<a href="https://colab.research.google.com/github/JuanPedregal/Tarea_01/blob/main/Tarea_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Cargamos la base_tarea
from google.colab import files
uploaded = files.upload()

Saving base_tarea.xls to base_tarea.xls

In [ ]:
# Instalamos pandas y convertimos la base en un DataFrame
import pandas as pd
df = pd.read_excel('base_tarea.xls')
df

      Year       ID  ... Labor_Hours       date
0     2013   103381  ...       22392 2003-06-17
1     2013   103404  ...       28447 2005-09-21
2     2013   100759  ...      474784 2001-01-13
3     2013   103246  ...       29193 2006-01-03
4     2013   103451  ...       46393 2007-05-21
...    ...      ...  ...         ...        ...
1445  2013  1103254  ...        8249 2006-02-05
1446  2013  1102636  ...        1449 2007-02-07
1447  2013  4407233  ...       43684 2002-08-17
1448  2013  1518524  ...         622 2002-08-16
1449  2013  1519685  ...        1020 2005-09-28

[1450 rows x 12 columns]

In [ ]:
# Punto 1
(a,b) = (df.shape) #nombro a "a" como la cantidad de filas y "b" cantidad de columnas
print(df.head(a))

      Year       ID  ... Labor_Hours       date
0     2013   103381  ...       22392 2003-06-17
1     2013   103404  ...       28447 2005-09-21
2     2013   100759  ...      474784 2001-01-13
3     2013   103246  ...       29193 2006-01-03
4     2013   103451  ...       46393 2007-05-21
...    ...      ...  ...         ...        ...
1445  2013  1103254  ...        8249 2006-02-05
1446  2013  1102636  ...        1449 2007-02-07
1447  2013  4407233  ...       43684 2002-08-17
1448  2013  1518524  ...         622 2002-08-16
1449  2013  1519685  ...        1020 2005-09-28

[1450 rows x 12 columns]

In [ ]:
# Punto 2
print(df.dtypes)

Year                          int64
ID                            int64
Name                         object
State                        object
County                       object
Status                       object
Type                         object
Company Type                 object
Production                    int64
Average Employees             int64
Labor_Hours                   int64
date                 datetime64[ns]
dtype: object

In [ ]:
# Punto 3
# Una forma: a partir del df seleccionar las columnas que queremos
print(df[['County','Production','Labor_Hours']])
# Otra forma: crear un nuevo DataFrame usando usecols
df1 = pd.read_excel(('base_tarea.xls'), usecols = ['County','Production','Labor_Hours'])
print(df1)

        County  Production  Labor_Hours
0         Bibb       56004        22392
1       Blount       28807        28447
2      Fayette     1440115       474784
3     Franklin       87587        29193
4     Franklin      147499        46393
...        ...         ...          ...
1445     Perry       18532         8249
1446    Saline        5070         1449
1447   Russell      377607        43684
1448      Pike        7744          622
1449      Pike       17357         1020

[1450 rows x 3 columns]
        County  Production  Labor_Hours
0         Bibb       56004        22392
1       Blount       28807        28447
2      Fayette     1440115       474784
3     Franklin       87587        29193
4     Franklin      147499        46393
...        ...         ...          ...
1445     Perry       18532         8249
1446    Saline        5070         1449
1447   Russell      377607        43684
1448      Pike        7744          622
1449      Pike       17357         1020

[1450 rows x 3 columns]

In [ ]:
# Punto 4 (usamos describe porque sum () nos tiraba la suma)
print(df["Production"].describe ())

count    1.450000e+03
mean     6.792012e+05
std      4.414922e+06
min      0.000000e+00
25%      0.000000e+00
50%      3.060650e+04
75%      2.514752e+05
max      1.110055e+08
Name: Production, dtype: float64

In [ ]:
# Punto 5
# Instalamos numpy
import numpy as np
# Insertamos la columna con valores NaN a la derecha de la cuarta columna.
df.insert(4, "columna", np.nan ,allow_duplicates=False)
df

      Year       ID  ... Labor_Hours       date
0     2013   103381  ...       22392 2003-06-17
1     2013   103404  ...       28447 2005-09-21
2     2013   100759  ...      474784 2001-01-13
3     2013   103246  ...       29193 2006-01-03
4     2013   103451  ...       46393 2007-05-21
...    ...      ...  ...         ...        ...
1445  2013  1103254  ...        8249 2006-02-05
1446  2013  1102636  ...        1449 2007-02-07
1447  2013  4407233  ...       43684 2002-08-17
1448  2013  1518524  ...         622 2002-08-16
1449  2013  1519685  ...        1020 2005-09-28

[1450 rows x 13 columns]

In [ ]:
# Punto 6 
df2 = pd.read_excel(('base_tarea.xls'), skiprows=[i for i in range(1,11)])
df2

      Year       ID  ... Labor_Hours       date
0     2013   103180  ...      196963 2005-09-28
1     2013   103182  ...       87314 2005-09-30
2     2013   103285  ...       90584 2006-03-07
3     2013   103332  ...       61394 2007-12-07
4     2013   103375  ...        1900 2002-12-07
...    ...      ...  ...         ...        ...
1435  2013  1103254  ...        8249 2006-02-05
1436  2013  1102636  ...        1449 2007-02-07
1437  2013  4407233  ...       43684 2002-08-17
1438  2013  1518524  ...         622 2002-08-16
1439  2013  1519685  ...        1020 2005-09-28

[1440 rows x 12 columns]

In [ ]:
# Punto 7
# Sumamos estas dos columnas y nos quedamos con el valor
sum_row = df[["Production","Labor_Hours"]].sum()
# Creamos un DataFrame con estos valores para que queden en forma de fila
df_sum = pd.DataFrame(data=sum_row).T 
# Usamos reindex para "acoplar" las columnas que teniamos en df a las columnas de df_sum
df_sum = df_sum.reindex(columns=df.columns) 
# Agregamos esta fila en un nuevo DataFrame dentro de nuestro df
df_final=df.append(df_sum,ignore_index=True) 
df_final

        Year         ID  ... Labor_Hours       date
0     2013.0   103381.0  ...       22392 2003-06-17
1     2013.0   103404.0  ...       28447 2005-09-21
2     2013.0   100759.0  ...      474784 2001-01-13
3     2013.0   103246.0  ...       29193 2006-01-03
4     2013.0   103451.0  ...       46393 2007-05-21
...      ...        ...  ...         ...        ...
1446  2013.0  1102636.0  ...        1449 2007-02-07
1447  2013.0  4407233.0  ...       43684 2002-08-17
1448  2013.0  1518524.0  ...         622 2002-08-16
1449  2013.0  1519685.0  ...        1020 2005-09-28
1450     NaN        NaN  ...   177910757        NaT

[1451 rows x 13 columns]

In [ ]:
# Punto 8
df3 =  df.head(n=10)
df3

   Year      ID  ... Labor_Hours       date
0  2013  103381  ...       22392 2003-06-17
1  2013  103404  ...       28447 2005-09-21
2  2013  100759  ...      474784 2001-01-13
3  2013  103246  ...       29193 2006-01-03
4  2013  103451  ...       46393 2007-05-21
5  2013  103433  ...       47195 2005-06-25
6  2013  100329  ...      144002 2006-02-05
7  2013  100851  ...     1001809 2007-02-07
8  2013  102901  ...       12396 2002-08-17
9  2013  102901  ...     1237415 2002-08-16

[10 rows x 13 columns]

In [ ]:
# Punto 9
df4 = df[['Labor_Hours','ID']].groupby('ID').sum() 
df4

         Labor_Hours
ID
100329        144002
100347        215295
100515          6240
100759        474784
100851       1001809
...              ...
4801353      2811138
4801429       161270
4801645        35687
4801646       661265
5000030       286079

[1321 rows x 1 columns]

In [ ]:
# Punto 10
# Creamos una columna que sea igual a nuestro indice así podamos usar query en función de ID
df4['ID'] = df4.index
print(df4.query('ID == 102976'))

        Labor_Hours      ID
ID
102976        38021  102976

In [ ]:
# Punto 11
print(df4.query('Labor_Hours >= 25000'))

         Labor_Hours       ID
ID
100329        144002   100329
100347        215295   100347
100759        474784   100759
100851       1001809   100851
101247       1551141   101247
...              ...      ...
4801353      2811138  4801353
4801429       161270  4801429
4801645        35687  4801645
4801646       661265  4801646
5000030       286079  5000030

[802 rows x 2 columns]

In [ ]:
# Punto 12
# Creando filtros boleanos
f2 = df["ID"].isin(["102976", "102901"])
df[f2]

    Year      ID  ... Labor_Hours       date
8   2013  102901  ...       12396 2002-08-17
9   2013  102901  ...     1237415 2002-08-16
18  2013  102976  ...       14828 2006-11-15
19  2013  102976  ...       23193 2007-08-10

[4 rows x 13 columns]

In [ ]:
# Punto13
df.sort_values(by=["Labor_Hours"])

      Year       ID  ... Labor_Hours       date
837   2013  3608140  ...          35 2005-09-21
213   2013  1519619  ...          40 2005-07-24
1437  2013  3610027  ...          53 2005-07-24
740   2013  3609189  ...          54 2001-01-13
1433  2013  1519554  ...         133 2007-12-07
...    ...      ...  ...         ...        ...
1271  2013  4601437  ...     2194378 2007-02-07
25    2013   101401  ...     2464719 2005-06-25
1413  2013  4801353  ...     2811138 2006-03-07
711   2013  3607230  ...     3015772 2005-09-30
1406  2013  4800977  ...     3206295 2005-06-25

[1450 rows x 13 columns]

In [44]:
# Punto 14
lista = [ df [(df["date"] >= "2005-02-01") & (df["date"] <= "2006-11-30")] ]
lista

[      Year       ID  ... Labor_Hours       date
 1     2013   103404  ...       28447 2005-09-21
 3     2013   103246  ...       29193 2006-01-03
 5     2013   103433  ...       47195 2005-06-25
 6     2013   100329  ...      144002 2006-02-05
 10    2013   103180  ...      196963 2005-09-28
 ...    ...      ...  ...         ...        ...
 1440  2013  3609405  ...        5670 2005-09-21
 1442  2013  3609337  ...        5175 2006-01-03
 1444  2013  1519713  ...         200 2005-06-25
 1445  2013  1103254  ...        8249 2006-02-05
 1449  2013  1519685  ...        1020 2005-09-28

 [745 rows x 13 columns]]

In [ ]:
# Punto 15